**Reminder:** You must write your own code first independently! After that, you can check ChatGPT code and put it in the cell provided for ChatGPT code.

# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [81]:
#Write your code here

import pandas as pd

df_data = pd.read_csv("Data/Purchase_Data.csv")
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [82]:
#Write your code here

types = df_data.dtypes
types

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [83]:
#Write you code here

result_1 = df_data.loc[ : , ["invoice_number","invoice_time"] ]

result_1.head()

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [84]:
#Write you code here
result_2 = df_data.loc[ 0:1, ]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [85]:
#Write your code here

result_3 = df_data.loc[ 0:3, ["invoice_number","invoice_time","store_id","product_id","category_id"] ]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [86]:
#Write your code here

result_4 = df_data.loc[ [0,4,6] , [ "invoice_time","price" ] ]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [87]:
shape = df_data.shape
num_rows = shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [88]:
#Write your code here

last_row = df_data.loc[ num_rows - 1 , ]
last_row

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

In [ ]:
#Paste ChatGPT code here for all parts:

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [89]:
#Write your code here

avg_price = df_data["price"].mean()
print( avg_price )

max_price = df_data["price"].max()
print( max_price )

3.1920522110741363
6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [90]:
#Write you code here

avg = df_data[ ["price", "num_item"] ].mean()
avg_price = avg[0]
avg_num_items = avg[1] 
print( avg_price, avg_num_items )

3.1920522110741363 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [91]:
#Write your code here

df_data[ "total" ] = df_data[ "price" ] * df_data[ "num_item" ]

df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the average price of the three most expensive purchases?

In [92]:
#Write your code here

sorted_data = df_data.sort_values( by = "total", inplace = False, ascending = False )
print( sorted_data.head(3) )

top_three = sorted_data.loc[ [ 4510, 3784, 4288 ], [ "total" ] ]
top_mean = top_three.mean()
top_mean

      invoice_number   invoice_time store_id  product_id  category_id  \
4510    2.020000e+11  8/30/15 20:21      628    21000362       210301
3784    2.020000e+11  8/26/15 17:12     6666     7000294       210101
4288    2.020000e+11   8/29/15 8:31     6666     7000294       210101

      num_item  price  total
4510     116.0    3.0  348.0
3784      48.0    1.5   72.0
4288      48.0    1.5   72.0

total    164.0
dtype: float64

How many different products are there?

In [93]:
#Write your code here

unique = df_data[ "product_id" ].unique()
num_prods = len(unique)
num_prods

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [94]:
#Write your code here
summary = df_data.describe()
avg_total = summary.loc["mean","total"]
med_total = summary.loc["50%","total"]
diff = avg_total - med_total
diff

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [95]:
#Write your code here

no_title = df_data.drop( ["total"], axis = 1, inplace = False)

no_title.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [96]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
total             float64
dtype: object

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [100]:
#Write your code here
df_data = pd.read_csv("Data/Purchase_Data.csv",parse_dates = ["invoice_time"])
df_data.dtypes

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [101]:
#Write your code here
df_data["month"] = df_data.invoice_time.dt.month
df_data["DOW"] = df_data.invoice_time.dt.weekday
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,month,DOW
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,7,2
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,7,2
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,7,2
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,7,2
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,7,2

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [103]:
#Write your code here

counts = df_data.DOW.value_counts()
purchases_wed = counts[3]
purchases_wed

828

In [ ]:
#Paste ChatGPT code here for all parts:

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [117]:
#Write your code here

import pandas as pd

df_titanic = pd.read_csv("Data/Titanic.csv")
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [119]:
#Write your code here

df_titanic = df_titanic.rename( columns = {"Name": "Passenger_Name", "Ticket": "Ticket_Num"})
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [120]:
#Write your code here
titanic = df_titanic.set_index("PassengerId")
titanic

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Select the name of passenger 896

In [134]:
#Write your code here
p896 = titanic.loc[ 896, ["Passenger_Name"] ]
p896

Passenger_Name    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: 896, dtype: object

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [135]:
#Write your code here
df_titanic #I stored passengerid as row number in a different dataframe, so i don't need to change the initial one

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [136]:
#Write you code here
df_titanic.isnull().sum()["Age"]

86

Compute the avg age of passengers ignoring the missing data.

In [139]:
#Write your code here
avg_age = df_titanic.Age.mean()
avg_age

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [140]:
#Write your code here
df_titanic.fillna({"Age":avg_age}, inplace = True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [142]:
#Write your code here
sorted_data2 = df_titanic.sort_values(by = "Age", inplace = False, ascending = False)
sorted_data2

oldest = sorted_data2.reset_index(inplace = False, drop = True)
oldest.loc[0:4, "Age"].mean()

67.0

In [ ]:
#Paste ChatGPT code here for all parts: